app/controllers/display_controller.rb

  def index
    @showing_today = Viewing.find :first, :include=>[:film], :conditions=>["viewings.scheduled_at > ? and viewings.scheduled_at <= ?", Date.today.to_time, Date.tomorrow.to_time ]
---
SELECT * FROM "viewings" WHERE (viewings.scheduled_at > '2010-02-07' and viewings.scheduled_at <= '2010-02-08') LIMIT 1
SELECT DISTINCT "films".id FROM "films" LEFT OUTER JOIN "viewings" ON viewings.film_id = films.id ORDER BY viewings.scheduled_at DESC LIMIT 5