app/controllers/films_controller.rb

  def index
    @films = Film.all
---
SELECT * FROM "films"

  def show
    @film = Film.find(params[:id])
---
SELECT * FROM "films" WHERE ("films"."id" = 1)

  def edit
    @film = Film.find(params[:id])
---
SELECT * FROM "films" WHERE ("films"."id" = 3)

  def create
    @film = Film.new(params[:film])

    respond_to do |format|
      if @film.save
---
INSERT INTO "films" ("suggested_by", "created_at", "title", "director", "released_on", "updated_at", "imdb_permalink", "viewing_id", "synopsis") VALUES('Charles', '2010-02-01 00:30:00', 'The Abyss', 'James Cameron', '1982-08-09', '2010-02-01 00:30:00', 'http://www.imdb.com/title/tt0096754/', NULL, 'A civilian diving team are enlisted to search for a lost nuclear submarine and face danger while encountering an alien aquatic species.')

  def update
    @film = Film.find(params[:id])

    respond_to do |format|
      if @film.update_attributes(params[:film])
---
SELECT * FROM "films" WHERE ("films"."id" = 3)
UPDATE "films" SET "updated_at" = '2010-02-01 00:35:51', "director" = '' WHERE "id" = 3