app/controllers/viewings_controller.rb

SELECT * FROM "viewings"
---
  def index
    @viewings = Viewing.all

SELECT * FROM "viewings" WHERE ("viewings"."id" = 1)
---
  def show
    @viewing = Viewing.find(params[:id])

SELECT * FROM "viewings" WHERE ("viewings"."id" = 1)
---
  def edit
    @viewing = Viewing.find(params[:id])

SELECT * FROM "viewings" WHERE ("viewings"."id" = 4)
UPDATE "viewings" SET "updated_at" = '2010-02-08 01:13:30', "title" = '', "scheduled_at" = '2010-02-08 01:13:00' WHERE "id" = 4
---
  def update
    @viewing = Viewing.find(params[:id])

    respond_to do |format|
      if @viewing.update_attributes(params[:viewing])